[{"title":"'Music and the Spoken Word' to premiere in Spanish","link":"/article/50658587/music-and-the-spoken-word-to-premiere-in-spanish-","summary":"The Tabernacle Choir at Temple Square's \"Music and the Spoken Word\" will premiere in Spanish later this month as part of a push to increase its visibility internationally."},{"title":"Utah Pride Festival barriers pushing some to organize their own Pride festivities","link":"/article/50639694/utah-pride-festival-barriers-pushing-some-to-organize-their-own-pride-festivities","summary":"Frustration with increases in vendor booth pricing, unaligned values and a lack of inclusivity has pushed some in the LGBTQ community to organize their own Pride celebrations."},{"title":"'You are welcome here': Salt Lake County event offers support to Afghanistan refugees","link":"/article/50658162/you-are-welcome-here-salt-lake-county-event-offers-support-to-afghanistan-refugees-","summary":"Salt Lake County hosted an Emergency Kit Distribution and Resource Fair on Thursday, providing Afghanistan immigrants food, other essential items, and information on how to obtain work and education in the county."},{"title":"Pride month kicks off in Utah with interfaith service","link":"/article/50657293/pride-month-kicks-off-in-utah-with-interfaith-service-","summary":"Representatives from wide a variety of faiths gathered Wednesday night to share messages of belonging, joy and strength for the LGBTQ community."},{"title":"EPA awards $65M contract for uranium mine cleanups on Navajo Nation","link":"/article/50657143/epa-awards-65m-contract-for-uranium-mine-cleanups-on-navajo-nation-","summary":"The U.S. Environmental Protection Agency has awarded a $65 million contract to help in the long-term project to cleanup hundreds of uranium mines on the Navajo Nation that were left behind after the Cold War."},{"title":"Utah is getting its 1st full-service LGBTQ health clinic","link":"/article/50656794/utah-is-getting-its-1st-full-service-lgbtq-health-clinic","summary":"The Utah AIDS Foundation announced Wednesday that it is expanding to become Utah's first full-service LGBTQ health care clinic."},{"title":"Utah Asian Festival uniting multigenerational coalition of Utahns","link":"/article/50653933/utah-asian-festival-uniting-multigenerational-coalition-of-utahns-","summary":"The annual Utah Asian Festival will feature two stages with live dance, music and cultural performances, ranging from Chinese lion dance to K-pop dance numbers, on Saturday, June 3."},{"title":"This nonprofit just launched a bilingual program to help Utahns navigate medical debt","link":"/article/50651309/this-nonprofit-just-launched-a-bilingual-program-to-help-utahns-navigate-medical-debt","summary":"The program's advocates are trained to give legal advice about how to resolve medical debt."},{"title":"From home kitchen to food truck: Dumpling business offers blend of experimental flavors","link":"/article/50652504/from-home-kitchen-to-food-truck-dumpling-business-offers-blend-of-experimental-flavors","summary":"Yagi's Dump Truck launched in 2021 in a Salt Lake home kitchen. The couple behind the business has spent the last two years prepping to expand to a food truck."},{"title":"Foundation hosts 'Little Mermaid' screening to promote multicultural family unity","link":"/article/50654058/foundation-hosts-little-mermaid-screening-to-promote-multicultural-family-unity","summary":"Small fishnets draped over seats, bubbles hung from the ceiling, and a sparkly blue flooring decorated the South Jordan Megaplex theater as dozens of families, many with children of color, packed the seats — creating a world that, despite the oxygen, most definitely was \"under the sea.\""},{"title":"Utah memorial celebrates contributions of Pacific Islander women","link":"/article/50654285/utah-memorial-celebrates-contributions-of-pacific-islander-women","summary":"Tucked in a place you might never visit, and in a place you might have never heard of, there is a new memorial in Utah."},{"title":"New Salt Lake space hopes to offer community for artists of color","link":"/article/50654066/new-salt-lake-space-hopes-to-offer-community-for-artists-of-color-","summary":"Poetry on Main — a new gift shop, coworking space and small performance venue — hopes to offer spaces for LGBTQ people and artists of color to flourish."},{"title":"Navajo Nation receiving federal funding for energy improvements","link":"/article/50653008/navajo-nation-receiving-federal-funding-for-energy-improvements","summary":"The Navajo Nation has received a total of $3.5 million for energy projects from two separate U.S. Department of Energy grant programs."},{"title":"Utah woman shares her lei-making gift with others","link":"/article/50648989/utah-woman-shares-her-lei-making-gift-with-others","summary":"The tradition of the lei is more than just a garland of flowers for one South Jordan woman. Leis represent a connection to Kamie Afo Aiono's Pacific Island heritage."},{"title":"Utah offering additional Spanish library books, audiobooks for students","link":"/article/50646373/utah-offering-additional-spanish-library-books-audiobooks-for-students","summary":"The Utah State Library Division is offering a number of new materials for kids and teens at school and public libraries."},{"title":"Haitian Americans celebrate island nation in Salt Lake City","link":"/article/50648352/haitian-americans-celebrate-island-nation-in-salt-lake-city","summary":"A group gathering in Washington Square Thursday afternoon to celebrate Haitian Flag Day might have been only a few dozen strong, but their excitement was palpable."},{"title":"Cox says 'imbeciles in Congress' responsible for current immigration crisis","link":"/article/50648186/cox-says-imbeciles-in-congress-responsible-for-current-immigration-crisis-","summary":"The governor repeated his tried-and-true stance on the matter: Border security and fixing legal immigration are not mutually exclusive."},{"title":"Living Traditions Festival happening this weekend in Salt Lake City","link":"/article/50647072/living-traditions-festival-happening-this-weekend-in-salt-lake-city","summary":"Utahns have an opportunity to enjoy food, live performances and art from a variety of cultures that make up the Beehive State at the free Living Traditions Festival in Salt Lake City this weekend."},{"title":"USU joins other Utah universities in offering free tuition for Native Americans","link":"/article/50646098/usu-joins-other-utah-universities-in-offering-free-tuition-for-native-americans-","summary":"Utah State University announced Monday the launch of a new scholarship for Native American students that covers tuition and student body fees that are not covered by other scholarships and grants."},{"title":"Huntsman Cancer Institute showcases donated American Indian artwork","link":"/article/50640202/huntsman-cancer-institute-showcases-donated-american-indian-artwork","summary":"The Huntsman Cancer Institute dedicated a new cancer care wing on Monday, featuring eight stories about comprehensive cancer care and women's cancers."},{"title":"Utahn amplifying Asian American and Pacific Islander voices beyond the month of May","link":"/article/50641866/utahn-amplifying-asian-american-and-pacific-islander-voices-beyond-the-month-of-may","summary":"This month, we're celebrating the cultures and contributions of the Asian American and Pacific Islander community. KSL's Tamara Vaifanua talked to one Utahn who is empowering the next generation."},{"title":"How capoeira is changing lives, building community in SLC","link":"/article/50641017/how-capoeira-is-changing-lives-building-community-in-slc-","summary":"Capoeira changed Brazilian native Mauro Romualdo's life. Now he's passing on the martial art/dance to Utahns."},{"title":"From India to Ireland: Multiethnic festival to celebrate cultural diversity in Salt Lake City","link":"/article/50642889/from-india-to-ireland-multiethnic-festival-to-celebrate-cultural-diversity-in-salt-lake-city","summary":"The 21st annual Celebration of Cultural Diversity Multiethnic Performing Arts Festival is a free festival, day-long event highlighting the city's cultural richness."},{"title":"New exhibit highlights Corky Lee, who photographed Asian Americans in Utah and beyond","link":"/article/50641203/new-exhibit-highlights-corky-lee-who-photographed-asian-americans-in-utah-and-beyond-","summary":"Lee's work included correcting the historical record, which had ignored Chinese railroad workers contributions in Utah and the country at large."},{"title":"How one program helps hundreds of refugee students across college finish line","link":"/article/50640214/how-one-program-helps-hundreds-of-refugee-students-across-college-finish-line","summary":"One Refugee helps refugee students complete their higher education and transition into careers through academic mentoring, professional development and financial assistance."},{"title":"","summary":""}]